---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamType
source: html/8aeb5f08-2207-5039-e9f2-d898f9602741.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamType Property

Can't make type "[Family Name]". It will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId DeletingBadFamType { get; }
```